# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10s.yaml' will call yolov10.yaml with scale 's'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1280]  # updated scaling factors for 's' model

backbone:
  # [from, repeats, module, args]
  - [-1, 1, XADNet, [32]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1280, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1280, True]]
  - [-1, 1, SPPF, [1280, 5]] # 9
  - [-1, 1, PSA, [1280]] # 10

# YOLOv10 Head
head:
  - [-1, 1, Conv, [640, 1, 1]] # 11
  - [6, 1, Conv, [640, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, CSPEStage, [640]] # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #15
  - [4, 1, Conv, [320, 3, 2]] # 16
  - [[15, -1, 6], 1, Concat, [1]]
  - [-1, 3, CSPEStage, [640]] # 18

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, CSPEStage, [320]] # 21

  - [-1, 1, Conv, [320, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 3, CSPEStage, [640]] # 24

  - [18, 1, SCDown, [320, 3, 2]] # 25
  - [24, 1, SCDown, [320, 3, 2]] # 26
  - [[14, 25, -1], 1, Concat, [1]]
  - [-1, 3, C2fCIB, [1280]] # 28

  - [[21, 24, 28], 1, v10Detect, [nc]]  # Detect(P3, P4, P5)
